In [59]:
# 파이썬 자료형
a=[1,2,3,4,5]
len(a)

5

In [8]:
a

[1, 2, 3, 4, 5]

In [9]:
b=(1,2,3,4,5)

In [10]:
b

(1, 2, 3, 4, 5)

In [11]:
type(a)

list

In [12]:
type(b)

tuple

In [13]:
a[0:3]

[1, 2, 3]

In [14]:
b[0:3]

(1, 2, 3)

In [17]:
# {key : value, key : value, .....}
# key ==> value 접근
c={'name' : ['kim','lee','park','kim'],
   'english' : [90,80,60,70],
   'math' : [50,60,100,20]}

In [26]:
c['math']

[50, 60, 100, 20]

In [22]:
d={'kim': 25, 'park': 30, 'mr. park': 28}

In [27]:
type(d)

dict

In [29]:
import pandas as pd

In [30]:
df=pd.DataFrame({'name' : ['kim','lee','park','kim'],
   'english' : [90,80,60,70],
   'math' : [50,60,100,20]})

In [31]:
df

   name  english  math
0   kim       90    50
1   lee       80    60
2  park       60   100
3   kim       70    20

In [32]:
type(df)

pandas.core.frame.DataFrame

In [33]:
df['english']

0    90
1    80
2    60
3    70
Name: english, dtype: int64

In [34]:
df['name']

0     kim
1     lee
2    park
3     kim
Name: name, dtype: object

In [35]:
df['math']

0     50
1     60
2    100
3     20
Name: math, dtype: int64

In [37]:
sum(df['english'])/4

75.0

In [48]:
df_exam = pd.read_excel('excel_exam.xlsx', sheet_name = 1)

In [49]:
import pandas as pd

In [51]:
df_exam=pd.read_excel('excel_exam.xlsx')

In [52]:
df_exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [53]:
df_exam=pd.read_csv('exam.csv')

In [54]:
df_exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [60]:
sum(df_exam['english'])/20

84.9

In [61]:
sum(df_exam['math'])/len(df_exam)

57.45

In [62]:
sum(df_exam['science'])/len(df_exam)

59.45

In [63]:
import pandas as pd

In [64]:
df_exam = pd.read_csv('exam.csv')

In [65]:
df_exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [69]:
df_midterm = pd.DataFrame({'english':[90,80,60,70],
                           'math':[50,60,100,20],
                           'nclass':[1,1,2,2]})

In [70]:
df_midterm

   english  math  nclass
0       90    50       1
1       80    60       1
2       60   100       2
3       70    20       2

In [71]:
df_midterm.to_csv('output_newdata.csv')

In [80]:
df_midterm.to_csv('output_newdata.csv', index=False)

In [85]:
df_midterm.to_excel('output_newdata.xlsx')

In [86]:
head(df_midterm)

NameError: name 'head' is not defined

In [87]:
df_midterm.head()

   english  math  nclass
0       90    50       1
1       80    60       1
2       60   100       2
3       70    20       2

In [88]:
# 5단원

In [97]:
import pandas as pd
exam=pd.read_csv('exam.csv')
exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [98]:
exam.tail(2)

    id  nclass  math  english  science
18  19       5    89       68       87
19  20       5    78       83       58

In [99]:
exam.shape

(20, 5)

In [101]:
exam.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       20 non-null     int64
 1   nclass   20 non-null     int64
 2   math     20 non-null     int64
 3   english  20 non-null     int64
 4   science  20 non-null     int64
dtypes: int64(5)
memory usage: 932.0 bytes

In [104]:
exam.describe()

             id     nclass       math    english    science
count  20.00000  20.000000  20.000000  20.000000  20.000000
mean   10.50000   3.000000  57.450000  84.900000  59.450000
std     5.91608   1.450953  20.299015  12.875517  25.292968
min     1.00000   1.000000  20.000000  56.000000  12.000000
25%     5.75000   2.000000  45.750000  78.000000  45.000000
50%    10.50000   3.000000  54.000000  86.500000  62.500000
75%    15.25000   4.000000  75.750000  98.000000  78.000000
max    20.00000   5.000000  90.000000  98.000000  98.000000

In [105]:
import pandas as pd

In [107]:
mpg=pd.read_csv('mpg.csv')

In [108]:
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [109]:
mpg.shape

(234, 11)

In [110]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234 entries, 0 to 233
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  category      234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 20.2+ KB

In [111]:
mpg.describe(include='all')

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
count,234,234,234.000000,234.000000,234.000000,234,234,234.000000,234.000000,234,234
unique,15,38,NaN,NaN,NaN,10,3,NaN,NaN,5,7
top,dodge,caravan 2wd,NaN,NaN,NaN,auto(l4),f,NaN,NaN,r,suv
freq,37,11,NaN,NaN,NaN,83,106,NaN,NaN,168,62
mean,NaN,NaN,3.471795,2003.500000,5.888889,NaN,NaN,16.858974,23.440171,NaN,NaN
std,NaN,NaN,1.291959,4.509646,1.611534,NaN,NaN,4.255946,5.954643,NaN,NaN
min,NaN,NaN,1.600000,1999.000000,4.000000,NaN,NaN,9.000000,12.000000,NaN,NaN
25%,NaN,NaN,2.400000,1999.000000,4.000000,NaN,NaN,14.000000,18.000000,NaN,NaN
50%,NaN,NaN,3.300000,2003.500000,6.000000,NaN,NaN,17.000000,24.000000,NaN,NaN
75%,NaN,NaN,4.600000,2008.000000,8.000000,NaN,NaN,19.000000,27.000000,NaN,NaN
max,NaN,NaN,7.000000,2008.000000,8.000000,NaN,NaN,35.000000,44.000000,NaN,NaN

In [112]:
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [121]:
mpg['total']=(mpg['cty']+mpg['hwy'])/2

In [122]:
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total_sum,total
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,23.5
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,25.0
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,25.5
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,25.5
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,21.0

In [123]:
sum(mpg['total'])/len(mpg)

20.14957264957265

In [124]:
mpg['total'].mean()

20.14957264957265

In [125]:
mpg['total'].describe()

count    234.000000
mean      20.149573
std        5.050290
min       10.500000
25%       15.500000
50%       20.500000
75%       23.500000
max       39.500000
Name: total, dtype: float64